
&НаКлиенте
Процедура БоксПриИзменении(Элемент)
    БоксПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура БоксПриИзмененииНаСервере()
    Если Объект.Бокс.Пустая() Тогда
        ДолгНаДату = 0;
        Возврат;
    КонецЕсли;
        Объект.Собственник = ЭлектроУчет.СобственникБоксаНаДату(Объект.Бокс, Объект.Дата - 1);
        ДолгНаДату = ЭлектроУчет.ЗадолженностьБоксаНаДату(Объект.Бокс, Объект.Дата - 1);
	КонецПроцедуры

&НаСервере
	Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		Если Не Объект.Бокс.Пустая() Тогда
		   ДолгНаДату = ЭлектроУчет.ЗадолженностьБоксаНаДату(Объект.Бокс, ТекущаяДатаСеанса());		
		КонецЕсли;
	КонецПроцедуры
