
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Не Бокс.Пустая() И Не НовыйСобственник.Пустая()
		И НовыйСобственник = ЭлектроУчет.СобственникБоксаНаДату(Бокс, Дата - 1) Тогда
		Сообщить("Этот владелец уже является собственником бокса на дату документа.");
		Отказ = Истина;	
	КонецЕсли;
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.СобственникиБоксов.Записывать = Истина;
	Движение = Движения.СобственникиБоксов.Добавить();
	Движение.Период = Дата;
	Движение.Бокс = Бокс;
	Движение.Собственник = НовыйСобственник;
КонецПроцедуры

