&НаКлиенте
Процедура СтарыйСчетчикПриИзменении(Элемент)
    ОбновитьПодсказкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
    ОбновитьПодсказкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьПодсказкиНаСервере()
    Если Объект.СтарыйСчетчик.Пустая() Тогда
        ПредыдущееПоказание = 0;
		Бокс = "";
        Возврат;
    КонецЕсли;
    ПредыдущееПоказание = ЭлектроУчет.ТекущееПоказаниеЧисло(Объект.СтарыйСчетчик, Объект.Дата - 1);
    Если Объект.СтарыйСчетчик.ТипСчетчика = Перечисления.ТипыСчетчиков.ИндивидуальныйПриборУчета Тогда
        Объект.Бокс = ЭлектроУчет.БоксСчетчикаНаДату(Объект.СтарыйСчетчик, Объект.Дата - 1);
    КонецЕсли;
	Если Объект.ПоказаниеСтарогоПриДемонтаже = 0 Тогда
	   Объект.ПоказаниеСтарогоПриДемонтаже = ПредыдущееПоказание; // замена без потребления
    КонецЕсли;
КонецПроцедуры

