
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Сумма <= 0 Тогда
	    Сообщить("Сумма платежа должна быть больше нуля.");
		Отказ = Истина;	
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.РасчетыСЭлектросетью.Записывать = Истина;
	Движение = Движения.РасчетыСЭлектросетью.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход; //оплата гасит долг
	Движение.Период = Дата;
	Движение.Ввод = Ввод;
	Движение.Сумма = Сумма;
КонецПроцедуры


